
## Terraform plan for environment: `dev`

**Commit:** e9f82fce58fd9a761ee31d5a17838832038b56d8


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`12 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_compute_environment.this["a_fargate"]
module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"]
module.service.module.batch.aws_batch_job_definition.this["job_configuration"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"]
module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"]
module.service.module.batch.aws_iam_instance_profile.instance[0]
module.service.module.batch.aws_iam_role.instance[0]
module.service.module.batch.aws_iam_role.service[0]
module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"]
module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_compute_environment.this["a_fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"
    }

  # module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate_spot-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"
    }

  # module.service.module.batch.aws_batch_job_definition.this["job_configuration"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas --container=/var/www/html/config/container-cli.php",
                  + "queue:process-queue",
                ]
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "processQueue-job"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags                       = {
          + "JobDefinition" = "BatchTest"
        }
      + tags_all                   = {
          + "Environment"   = "dev"
          + "JobDefinition" = "BatchTest"
          + "Repository"    = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 3

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestHighPriorityFargate"
      + priority              = 99
      + scheduling_policy_arn = (known after apply)
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "High priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "High priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestLowPriorityFargate"
      + priority              = 1
      + scheduling_policy_arn = (known after apply)
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "Low priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "Low priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"] will be created
  + resource "aws_batch_scheduling_policy" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "BatchTestHighPriorityFargate"
      + tags     = {
          + "JobQueue" = "High priority job queue"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "JobQueue"    = "High priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + fair_share_policy {
          + compute_reservation = 1
          + share_decay_seconds = 3600

          + share_distribution {
              + share_identifier = "A1*"
              + weight_factor    = 0.1
            }
          + share_distribution {
              + share_identifier = "A2"
              + weight_factor    = 0.2
            }
        }
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"] will be created
  + resource "aws_batch_scheduling_policy" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "BatchTestLowPriorityFargate"
      + tags     = {
          + "JobQueue" = "Low priority job queue"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "JobQueue"    = "Low priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + fair_share_policy {}
    }

  # module.service.module.batch.aws_iam_instance_profile.instance[0] will be created
  + resource "aws_iam_instance_profile" "instance" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "dev-batch-app-ecs-instance-role-"
      + path        = "/batch/"
      + role        = (known after apply)
      + tags        = {
          + "ModuleCreatedRole" = "Yes"
        }
      + tags_all    = {
          + "Environment"       = "dev"
          + "ModuleCreatedRole" = "Yes"
          + "Repository"        = "https://github.com/dvsa/vol-app"
        }
      + unique_id   = (known after apply)
    }

  # module.service.module.batch.aws_iam_role.instance[0] will be created
  + resource "aws_iam_role" "instance" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "ECSAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM instance role/profile for AWS Batch ECS instance(s)"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "dev-batch-app-ecs-instance-role-"
      + path                  = "/batch/"
      + tags                  = {
          + "ModuleCreatedRole" = "Yes"
        }
      + tags_all              = {
          + "Environment"       = "dev"
          + "ModuleCreatedRole" = "Yes"
          + "Repository"        = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.service.module.batch.aws_iam_role.service[0] will be created
  + resource "aws_iam_role" "service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                      + Sid       = "ECSAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM service role for AWS Batch"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "dev-batch-app-batch-role-"
      + path                  = "/batch/"
      + tags                  = {
          + "ModuleCreatedRole" = "Yes"
        }
      + tags_all              = {
          + "Environment"       = "dev"
          + "ModuleCreatedRole" = "Yes"
          + "Repository"        = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.service.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"] will be created
  + resource "aws_iam_role_policy_attachment" "instance" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = (known after apply)
    }

  # module.service.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

```

</details>